docs/benchmark/results-wrk2/raw/gateway-R80000-r1.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.00ms    9.79ms  77.18ms   84.62%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.29ms
 75.000%   15.29ms
 90.000%   23.73ms
 99.000%   42.43ms
 99.900%   56.03ms
 99.990%   69.25ms
 99.999%   74.37ms
100.000%   77.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.103     0.000000            1         1.00
       1.314     0.100000        70162         1.11
       1.999     0.200000       140387         1.25
       2.765     0.300000       210466         1.43
       3.747     0.400000       280667         1.67
       6.291     0.500000       350775         2.00
       8.367     0.550000       385818         2.22
       9.655     0.600000       420941         2.50
      11.535     0.650000       455999         2.86
      13.943     0.700000       491226         3.33
      15.287     0.750000       526154         4.00
      16.127     0.775000       543793         4.44
      17.663     0.800000       561205         5.00
      18.943     0.825000       578806         5.71
      19.919     0.850000       596277         6.67
      21.295     0.875000       613869         8.00
      22.543     0.887500       622584         8.89
      23.727     0.900000       631473        10.00
      24.687     0.912500       640208        11.43
      25.791     0.925000       648960        13.33
      27.775     0.937500       657652        16.00
      28.751     0.943750       662056        17.78
      29.535     0.950000       666483        20.00
      30.447     0.956250       670805        22.86
      31.791     0.962500       675196        26.67
      33.503     0.968750       679630        32.00
      34.143     0.971875       681753        35.56
      34.847     0.975000       683983        40.00
      35.871     0.978125       686181        45.71
      37.311     0.981250       688335        53.33
      38.879     0.984375       690554        64.00
      39.615     0.985938       691649        71.11
      40.415     0.987500       692738        80.00
      41.439     0.989062       693813        91.43
      43.039     0.990625       694908       106.67
      44.191     0.992188       696012       128.00
      44.991     0.992969       696563       142.22
      45.759     0.993750       697115       160.00
      46.591     0.994531       697660       182.86
      47.807     0.995313       698210       213.33
      48.735     0.996094       698750       256.00
      49.375     0.996484       699024       284.44
      50.303     0.996875       699302       320.00
      50.847     0.997266       699568       365.71
      51.679     0.997656       699849       426.67
      53.215     0.998047       700112       512.00
      53.631     0.998242       700261       568.89
      54.207     0.998437       700386       640.00
      54.847     0.998633       700524       731.43
      55.455     0.998828       700664       853.33
      56.095     0.999023       700799      1024.00
      56.479     0.999121       700868      1137.78
      57.375     0.999219       700934      1280.00
      58.143     0.999316       701003      1462.86
      59.743     0.999414       701072      1706.67
      60.447     0.999512       701145      2048.00
      60.927     0.999561       701174      2275.56
      61.727     0.999609       701208      2560.00
      63.135     0.999658       701243      2925.71
      64.287     0.999707       701277      3413.33
      64.767     0.999756       701312      4096.00
      65.599     0.999780       701328      4551.11
      66.943     0.999805       701345      5120.00
      68.287     0.999829       701364      5851.43
      68.479     0.999854       701380      6826.67
      68.863     0.999878       701398      8192.00
      68.991     0.999890       701405      9102.22
      69.311     0.999902       701414     10240.00
      69.759     0.999915       701423     11702.86
      70.783     0.999927       701431     13653.33
      71.231     0.999939       701440     16384.00
      71.679     0.999945       701444     18204.44
      73.215     0.999951       701448     20480.00
      73.599     0.999957       701454     23405.71
      73.727     0.999963       701457     27306.67
      73.791     0.999969       701461     32768.00
      73.855     0.999973       701465     36408.89
      73.855     0.999976       701465     40960.00
      73.983     0.999979       701470     46811.43
      73.983     0.999982       701470     54613.33
      74.047     0.999985       701472     65536.00
      74.111     0.999986       701473     72817.78
      74.303     0.999988       701474     81920.00
      74.367     0.999989       701475     93622.86
      74.495     0.999991       701476    109226.67
      74.559     0.999992       701477    131072.00
      74.687     0.999993       701478    145635.56
      74.687     0.999994       701478    163840.00
      74.879     0.999995       701479    187245.71
      74.879     0.999995       701479    218453.33
      74.943     0.999996       701480    262144.00
      74.943     0.999997       701480    291271.11
      74.943     0.999997       701480    327680.00
      75.263     0.999997       701481    374491.43
      75.263     0.999998       701481    436906.67
      75.263     0.999998       701481    524288.00
      75.263     0.999998       701481    582542.22
      75.263     0.999998       701481    655360.00
      77.247     0.999999       701482    748982.86
      77.247     1.000000       701482          inf
#[Mean    =       10.002, StdDeviation   =        9.795]
#[Max     =       77.184, Total count    =       701482]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  701991 requests in 15.04s, 448.55MB read
Requests/sec:  46679.19
Transfer/sec:     29.83MB