docs/benchmark/results-wrk2/raw/nginx-R100000-r3.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.05ms   12.14ms  95.74ms   66.43%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.18ms
 75.000%   23.95ms
 90.000%   30.32ms
 99.000%   45.95ms
 99.900%   63.71ms
 99.990%   77.63ms
 99.999%   83.65ms
100.000%   95.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.107     0.000000            1         1.00
       1.440     0.100000        87733         1.11
       2.253     0.200000       175512         1.25
       3.189     0.300000       263069         1.43
       4.671     0.400000       350755         1.67
      11.183     0.500000       438382         2.00
      15.111     0.550000       482220         2.22
      18.207     0.600000       526213         2.50
      20.127     0.650000       569928         2.86
      21.679     0.700000       613931         3.33
      23.951     0.750000       657565         4.00
      24.767     0.775000       679525         4.44
      25.487     0.800000       701542         5.00
      26.399     0.825000       723581         5.71
      27.839     0.850000       745357         6.67
      29.183     0.875000       767117         8.00
      29.743     0.887500       778215         8.89
      30.319     0.900000       789314        10.00
      30.911     0.912500       800213        11.43
      31.679     0.925000       811078        13.33
      32.799     0.937500       821904        16.00
      33.535     0.943750       827426        17.78
      34.239     0.950000       833130        20.00
      34.879     0.956250       838372        22.86
      35.679     0.962500       843862        26.67
      36.703     0.968750       849371        32.00
      37.407     0.971875       852124        35.56
      38.431     0.975000       854812        40.00
      39.487     0.978125       857583        45.71
      40.543     0.981250       860283        53.33
      41.887     0.984375       863024        64.00
      42.879     0.985938       864381        71.11
      43.999     0.987500       865741        80.00
      45.311     0.989062       867134        91.43
      46.335     0.990625       868476       106.67
      47.743     0.992188       869851       128.00
      48.511     0.992969       870525       142.22
      49.503     0.993750       871206       160.00
      50.335     0.994531       871891       182.86
      51.519     0.995313       872580       213.33
      53.055     0.996094       873271       256.00
      53.887     0.996484       873613       284.44
      54.495     0.996875       873948       320.00
      55.071     0.997266       874294       365.71
      55.775     0.997656       874631       426.67
      56.799     0.998047       874973       512.00
      57.535     0.998242       875146       568.89
      58.335     0.998437       875315       640.00
      59.519     0.998633       875485       731.43
      61.023     0.998828       875658       853.33
      63.903     0.999023       875828      1024.00
      65.055     0.999121       875913      1137.78
      66.495     0.999219       876000      1280.00
      67.455     0.999316       876086      1462.86
      68.863     0.999414       876172      1706.67
      70.143     0.999512       876261      2048.00
      70.847     0.999561       876298      2275.56
      71.679     0.999609       876343      2560.00
      72.831     0.999658       876384      2925.71
      73.919     0.999707       876429      3413.33
      74.495     0.999756       876470      4096.00
      75.007     0.999780       876491      4551.11
      75.327     0.999805       876514      5120.00
      75.583     0.999829       876534      5851.43
      75.903     0.999854       876555      6826.67
      76.671     0.999878       876576      8192.00
      77.311     0.999890       876587      9102.22
      77.887     0.999902       876598     10240.00
      79.295     0.999915       876612     11702.86
      79.743     0.999927       876620     13653.33
      80.447     0.999939       876631     16384.00
      80.767     0.999945       876635     18204.44
      80.895     0.999951       876641     20480.00
      81.407     0.999957       876646     23405.71
      81.663     0.999963       876653     27306.67
      81.983     0.999969       876657     32768.00
      82.111     0.999973       876659     36408.89
      82.367     0.999976       876662     40960.00
      82.751     0.999979       876665     46811.43
      83.071     0.999982       876667     54613.33
      83.327     0.999985       876671     65536.00
      83.327     0.999986       876671     72817.78
      83.519     0.999988       876673     81920.00
      83.647     0.999989       876674     93622.86
      83.711     0.999991       876676    109226.67
      83.775     0.999992       876677    131072.00
      83.775     0.999993       876677    145635.56
      84.415     0.999994       876678    163840.00
      84.799     0.999995       876679    187245.71
      84.799     0.999995       876679    218453.33
      86.591     0.999996       876680    262144.00
      86.591     0.999997       876680    291271.11
      86.655     0.999997       876681    327680.00
      86.655     0.999997       876681    374491.43
      86.655     0.999998       876681    436906.67
      87.231     0.999998       876682    524288.00
      87.231     0.999998       876682    582542.22
      87.231     0.999998       876682    655360.00
      87.231     0.999999       876682    748982.86
      87.231     0.999999       876682    873813.33
      95.807     0.999999       876683   1048576.00
      95.807     1.000000       876683          inf
#[Mean    =       14.048, StdDeviation   =       12.143]
#[Max     =       95.744, Total count    =       876683]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  878121 requests in 15.03s, 558.57MB read
Requests/sec:  58432.68
Transfer/sec:     37.17MB